In [1]:
import numpy as  np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [3]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [4]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [5]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [7]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [8]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [9]:
obj = pd.Series([4, 7, -3, 2])

In [10]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [11]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [12]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [13]:
frame = pd.DataFrame({'b':[4, 7, -3, 2], 'a':[0, 1, 0, 1]})

In [14]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [15]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [16]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [17]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [18]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [19]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [20]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [21]:
frame = pd.DataFrame({'b':[4, 7, -3, 2], 'a':[0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [22]:
frame

   b  a    c
0  4  0 -2.0
1  7  1  5.0
2 -3  0  8.0
3  2  1 -2.5

In [23]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [24]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [25]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [27]:
obj.index.is_unique

False

In [28]:
obj['a']

a    0
a    1
dtype: int64

In [29]:
obj['c']

4

In [30]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [31]:
df

          0         1         2
a -0.609038  0.138039 -1.664408
a  1.139565  0.560320 -0.785106
b -0.428784 -0.581487  0.493705
b -2.890034  0.745618 -1.193430

In [32]:
df.loc['b']

          0         1         2
b -0.428784 -0.581487  0.493705
b -2.890034  0.745618 -1.193430

In [2]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])

In [3]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [8]:
df.idxmax()

one    b
two    d
dtype: object

In [9]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [10]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [12]:
import pandas_datareader.data as web

In [13]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [14]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})

In [16]:
volume = pd.DataFrame({ticker: data['Volume']
                       for ticker, data in all_data.items()})

In [17]:
returns = price.pct_change()

In [18]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-10-11 -0.000630 -0.005516 -0.002103 -0.008629
2021-10-12 -0.009103 -0.013761 -0.004588 -0.015373
2021-10-13 -0.004240  0.002064  0.011711  0.008682
2021-10-14  0.020226  0.018684  0.021734  0.025468
2021-10-15  0.007513  0.008508  0.004822  0.001860

In [19]:
returns['MSFT'].corr(returns['IBM'])

0.51394259792164

In [20]:
returns['MSFT'].cov(returns['IBM'])

0.00014523833461375156

In [21]:
returns.MSFT.corr(returns.IBM)

0.51394259792164

In [22]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.441721  0.738719  0.665744
IBM   0.441721  1.000000  0.513943  0.483956
MSFT  0.738719  0.513943  1.000000  0.776624
GOOG  0.665744  0.483956  0.776624  1.000000

In [23]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000362  0.000138  0.000243  0.000214
IBM   0.000138  0.000268  0.000145  0.000134
MSFT  0.000243  0.000145  0.000298  0.000227
GOOG  0.000214  0.000134  0.000227  0.000286

In [24]:
returns.corrwith(returns.IBM)

AAPL    0.441721
IBM     1.000000
MSFT    0.513943
GOOG    0.483956
dtype: float64

In [25]:
returns.corrwith(volume)

AAPL   -0.077492
IBM    -0.100278
MSFT   -0.059405
GOOG   -0.125722
dtype: float64

In [26]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [27]:
uniques = obj.unique()

In [28]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [29]:
pd.value_counts(obj.values, sort=False)

b    2
a    3
d    1
c    3
dtype: int64

In [30]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [31]:
mask = obj.isin(['b', 'c'])

In [32]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [33]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [34]:
to_mach =  pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [35]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [37]:
pd.Index(unique_vals).get_indexer(to_mach)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [38]:
data = pd.DataFrame({'Qu1':[1, 3, 4, 3, 4],
                     'Qu2':[2, 3, 1, 2, 3], 
                     'Qu3':[1, 5, 2, 4, 4]})

In [39]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [ ]:
result = data.apply(pd.vali)